{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "0": 0,
      "1": 1,
      "00": 2,
      "11": 3,
      "100": 4,
      "10": 5,
      "1100": 6,
      "110": 7,
      "10000": 8,
      "1000": 9,
      "1010": 10,
      "110000": 11,
      "11000": 12,
      "1011": 13,
      "10100": 14,
      "1000000": 15,
      "100000": 16,
      "10110": 17,
      "10011": 18,
      "101000": 19,
      "1111": 20,
      "100100": 21,
      "101100": 22,
      "11000000": 23,
      "100110": 24,
      "1100000": 25,
      "11110": 26,
      "11100": 27,
      "111000": 28,
      "1010000": 29,
      "1011000": 30,
      "0000": 31,
      "1001000": 32,
      "10000000": 33,
      "110110": 34,
      "111010": 35,
      "111100": 36,
      "1001010": 37,
      "1001100": 38,
      "1110000": 39,
      "1101000": 40,
      "100000000": 41,
      "10100000": 42,
      "1001011": 43,
      "1111000": 44,
      "111011": 45,
      "10110000": 46,
      "1101010": 47,
      "1101100": 48,
      "1110100": 49,
      "10010000": 50,
      "10010100": 51,
      "10001000": 52,
      "10011000": 53,
      "10101010": 54,
      "1000110": 55,
      "110000000": 56,
      "1100110": 57,
      "11100000": 58,
      "1110011": 59,
      "000": 60,
      "101000000": 61,
      "10010110": 62,
      "11001100": 63,
      "10001010": 64,
      "10010011": 65,
      "10000110": 66,
      "11101000": 67,
      "1110110": 68,
      "1010110": 69,
      "11110000": 70,
      "10001100": 71,
      "101100000": 72,
      "111000000": 73,
      "10001011": 74,
      "1111000000": 75,
      "100100000": 76,
      "11010000": 77,
      "1011000000": 78,
      "11011000": 79,
      "11100100": 80,
      "10101000": 81,
      "100110000": 82,
      "1000000000": 83,
      "11010100": 84,
      "11001000": 85,
      "1101011": 86,
      "111010000": 87,
      "10101100": 88,
      "100101000": 89,
      "11101100": 90,
      "11100110": 91,
      "10000000000": 92,
      "100101100": 93,
      "10111000": 94,
      "111100000": 95,
      "110001100": 96,
      "100001000": 97,
      "11010110": 98,
      "101010100": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "0"
      ],
      [
        "11",
        "00"
      ],
      [
        "11",
        "0"
      ],
      [
        "100",
        "00"
      ],
      [
        "100",
        "0"
      ],
      [
        "10",
        "10"
      ],
      [
        "1100",
        "00"
      ],
      [
        "1100",
        "0"
      ],
      [
        "10",
        "11"
      ],
      [
        "10",
        "100"
      ],
      [
        "10000",
        "00"
      ],
      [
        "10000",
        "0"
      ],
      [
        "10",
        "110"
      ],
      [
        "100",
        "11"
      ],
      [
        "10",
        "1000"
      ],
      [
        "11",
        "11"
      ],
      [
        "100",
        "100"
      ],
      [
        "10",
        "1100"
      ],
      [
        "110000",
        "00"
      ],
      [
        "100",
        "110"
      ],
      [
        "110000",
        "0"
      ],
      [
        "11",
        "110"
      ],
      [
        "11",
        "100"
      ],
      [
        "11",
        "1000"
      ],
      [
        "10",
        "10000"
      ],
      [
        "10",
        "11000"
      ],
      [
        "00",
        "00"
      ],
      [
        "100",
        "1000"
      ],
      [
        "1000000",
        "0"
      ],
      [
        "110",
        "110"
      ],
      [
        "11",
        "1010"
      ],
      [
        "11",
        "1100"
      ],
      [
        "100",
        "1010"
      ],
      [
        "100",
        "1100"
      ],
      [
        "11",
        "10000"
      ],
      [
        "110",
        "1000"
      ],
      [
        "1000000",
        "00"
      ],
      [
        "10",
        "100000"
      ],
      [
        "100",
        "1011"
      ],
      [
        "11",
        "11000"
      ],
      [
        "11",
        "1011"
      ],
      [
        "10",
        "110000"
      ],
      [
        "110",
        "1010"
      ],
      [
        "110",
        "1100"
      ],
      [
        "11",
        "10100"
      ],
      [
        "100",
        "10000"
      ],
      [
        "100",
        "10100"
      ],
      [
        "1000",
        "1000"
      ],
      [
        "100",
        "11000"
      ],
      [
        "1010",
        "1010"
      ],
      [
        "1000",
        "110"
      ],
      [
        "11000000",
        "0"
      ],
      [
        "1100",
        "110"
      ],
      [
        "11",
        "100000"
      ],
      [
        "11",
        "10011"
      ],
      [
        "00",
        "0"
      ],
      [
        "10",
        "1000000"
      ],
      [
        "100",
        "10110"
      ],
      [
        "1100",
        "1100"
      ],
      [
        "1000",
        "1010"
      ],
      [
        "100",
        "10011"
      ],
      [
        "10000",
        "110"
      ],
      [
        "11",
        "101000"
      ],
      [
        "11",
        "10110"
      ],
      [
        "1010",
        "110"
      ],
      [
        "11",
        "110000"
      ],
      [
        "1000",
        "1100"
      ],
      [
        "10",
        "1100000"
      ],
      [
        "11",
        "1000000"
      ],
      [
        "1000",
        "1011"
      ],
      [
        "11",
        "11000000"
      ],
      [
        "100",
        "100000"
      ],
      [
        "110",
        "10000"
      ],
      [
        "10",
        "11000000"
      ],
      [
        "110",
        "11000"
      ],
      [
        "11",
        "100100"
      ],
      [
        "1010",
        "1000"
      ],
      [
        "100",
        "110000"
      ],
      [
        "100000000",
        "0"
      ],
      [
        "110",
        "10100"
      ],
      [
        "1100",
        "1000"
      ],
      [
        "110",
        "1011"
      ],
      [
        "11",
        "1010000"
      ],
      [
        "1010",
        "1100"
      ],
      [
        "100",
        "101000"
      ],
      [
        "11",
        "101100"
      ],
      [
        "11",
        "100110"
      ],
      [
        "1000000",
        "0000"
      ],
      [
        "100",
        "101100"
      ],
      [
        "1011",
        "1000"
      ],
      [
        "11",
        "1100000"
      ],
      [
        "11000",
        "1100"
      ],
      [
        "10000",
        "1000"
      ],
      [
        "110",
        "10110"
      ],
      [
        "1010",
        "10100"
      ]
    ]
  }
}