{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "0": 0,
      "1": 1,
      "00": 2,
      "01": 3,
      "001": 4,
      "011": 5,
      "0000": 6,
      "0011": 7,
      "0001": 8,
      "0111": 9,
      "0101": 10,
      "00001": 11,
      "00111": 12,
      "00011": 13,
      "01001": 14,
      "01111": 15,
      "010000": 16,
      "000011": 17,
      "01011": 18,
      "010001": 19,
      "001001": 20,
      "001111": 21,
      "000111": 22,
      "010011": 23,
      "0010000": 24,
      "0100001": 25,
      "001011": 26,
      "11": 27,
      "0010001": 28,
      "0000011": 29,
      "0000111": 30,
      "0001111": 31,
      "0100011": 32,
      "00000000": 33,
      "0001011": 34,
      "0010011": 35,
      "010111": 36,
      "0010101": 37,
      "0110000": 38,
      "00100001": 39,
      "00001111": 40,
      "00010000": 41,
      "0100111": 42,
      "00010001": 43,
      "01000011": 44,
      "00110000": 45,
      "01010000": 46,
      "00101001": 47,
      "011011": 48,
      "00100011": 49,
      "0010111": 50,
      "011111": 51,
      "01010001": 52,
      "0110001": 53,
      "00000011": 54,
      "01100001": 55,
      "00000001": 56,
      "001010000": 57,
      "00000101": 58,
      "01000111": 59,
      "0011111": 60,
      "0110011": 61,
      "00101011": 62,
      "00010011": 63,
      "00000111": 64,
      "000": 65,
      "0101111": 66,
      "00100111": 67,
      "001010001": 68,
      "01010101": 69,
      "00001011": 70,
      "001000011": 71,
      "00010101": 72,
      "000100001": 73,
      "01110000": 74,
      "010100001": 75,
      "0101011": 76,
      "010000111": 77,
      "0011011": 78,
      "000010000": 79,
      "000110000": 80,
      "01001111": 81,
      "001010011": 82,
      "01001011": 83,
      "00110001": 84,
      "00011111": 85,
      "010010000": 86,
      "001100001": 87,
      "001000111": 88,
      "010000011": 89,
      "00110011": 90,
      "111": 91,
      "0010100001": 92,
      "000010001": 93,
      "00101111": 94,
      "01010011": 95,
      "010010001": 96,
      "00011011": 97,
      "010110000": 98,
      "01110001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "0",
        "1"
      ],
      [
        "00",
        "1"
      ],
      [
        "01",
        "1"
      ],
      [
        "00",
        "00"
      ],
      [
        "001",
        "1"
      ],
      [
        "00",
        "01"
      ],
      [
        "011",
        "1"
      ],
      [
        "01",
        "01"
      ],
      [
        "00",
        "001"
      ],
      [
        "0011",
        "1"
      ],
      [
        "00",
        "011"
      ],
      [
        "01",
        "001"
      ],
      [
        "0111",
        "1"
      ],
      [
        "01",
        "0000"
      ],
      [
        "00",
        "0011"
      ],
      [
        "01",
        "011"
      ],
      [
        "01",
        "0001"
      ],
      [
        "001",
        "001"
      ],
      [
        "00111",
        "1"
      ],
      [
        "00",
        "0111"
      ],
      [
        "01",
        "0011"
      ],
      [
        "001",
        "0000"
      ],
      [
        "01",
        "00001"
      ],
      [
        "001",
        "011"
      ],
      [
        "1",
        "1"
      ],
      [
        "001",
        "0001"
      ],
      [
        "0000",
        "011"
      ],
      [
        "00",
        "00111"
      ],
      [
        "00",
        "01111"
      ],
      [
        "01",
        "00011"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "0001",
        "011"
      ],
      [
        "001",
        "0011"
      ],
      [
        "01",
        "0111"
      ],
      [
        "001",
        "0101"
      ],
      [
        "011",
        "0000"
      ],
      [
        "001",
        "00001"
      ],
      [
        "00",
        "001111"
      ],
      [
        "0001",
        "0000"
      ],
      [
        "01",
        "00111"
      ],
      [
        "0001",
        "0001"
      ],
      [
        "01",
        "000011"
      ],
      [
        "0011",
        "0000"
      ],
      [
        "0101",
        "0000"
      ],
      [
        "001",
        "01001"
      ],
      [
        "011",
        "011"
      ],
      [
        "001",
        "00011"
      ],
      [
        "001",
        "0111"
      ],
      [
        "01111",
        "1"
      ],
      [
        "0101",
        "0001"
      ],
      [
        "011",
        "0001"
      ],
      [
        "0000",
        "0011"
      ],
      [
        "011",
        "00001"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "001",
        "010000"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "01",
        "000111"
      ],
      [
        "001111",
        "1"
      ],
      [
        "011",
        "0011"
      ],
      [
        "001",
        "01011"
      ],
      [
        "0001",
        "0011"
      ],
      [
        "0000",
        "0111"
      ],
      [
        "00",
        "0"
      ],
      [
        "01",
        "01111"
      ],
      [
        "001",
        "00111"
      ],
      [
        "001",
        "010001"
      ],
      [
        "0101",
        "0101"
      ],
      [
        "00001",
        "011"
      ],
      [
        "001",
        "000011"
      ],
      [
        "0001",
        "0101"
      ],
      [
        "0001",
        "00001"
      ],
      [
        "0111",
        "0000"
      ],
      [
        "0101",
        "00001"
      ],
      [
        "0101",
        "011"
      ],
      [
        "01",
        "0000111"
      ],
      [
        "0011",
        "011"
      ],
      [
        "00001",
        "0000"
      ],
      [
        "00011",
        "0000"
      ],
      [
        "01",
        "001111"
      ],
      [
        "001",
        "010011"
      ],
      [
        "01001",
        "011"
      ],
      [
        "0011",
        "0001"
      ],
      [
        "0001111",
        "1"
      ],
      [
        "01001",
        "0000"
      ],
      [
        "0011",
        "00001"
      ],
      [
        "001",
        "000111"
      ],
      [
        "010000",
        "011"
      ],
      [
        "0011",
        "0011"
      ],
      [
        "11",
        "1"
      ],
      [
        "001",
        "0100001"
      ],
      [
        "00001",
        "0001"
      ],
      [
        "001",
        "01111"
      ],
      [
        "0101",
        "0011"
      ],
      [
        "01001",
        "0001"
      ],
      [
        "00011",
        "011"
      ],
      [
        "01011",
        "0000"
      ],
      [
        "0111",
        "0001"
      ]
    ]
  }
}