{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "0": 0,
      "1": 1,
      "00": 2,
      "01": 3,
      "100": 4,
      "101": 5,
      "0000": 6,
      "1100": 7,
      "0001": 8,
      "1101": 9,
      "0101": 10,
      "00100": 11,
      "11100": 12,
      "00101": 13,
      "01100": 14,
      "11101": 15,
      "010000": 16,
      "001100": 17,
      "01101": 18,
      "100100": 19,
      "010001": 20,
      "111100": 21,
      "001101": 22,
      "011100": 23,
      "0000100": 24,
      "0100100": 25,
      "11": 26,
      "0000101": 27,
      "0001100": 28,
      "0011100": 29,
      "101100": 30,
      "0100101": 31,
      "00000000": 32,
      "011101": 33,
      "1100100": 34,
      "1010000": 35,
      "0101100": 36,
      "111101": 37,
      "1010001": 38,
      "00000001": 39,
      "0011101": 40,
      "00100100": 41,
      "01001100": 42,
      "00010001": 43,
      "00001100": 44,
      "0111100": 45,
      "00000101": 46,
      "1111100": 47,
      "1101100": 48,
      "101101": 49,
      "01100100": 50,
      "00101100": 51,
      "01010001": 52,
      "11000001": 53,
      "00111100": 54,
      "00001101": 55,
      "10100100": 56,
      "000000100": 57,
      "1010101": 58,
      "010000100": 59,
      "01001101": 60,
      "1011100": 61,
      "000001100": 62,
      "000000101": 63,
      "01101100": 64,
      "11100100": 65,
      "010001100": 66,
      "001100100": 67,
      "01010101": 68,
      "00011100": 69,
      "10": 70,
      "0011": 71,
      "0001101": 72,
      "0111101": 73,
      "00010101": 74,
      "00100101": 75,
      "11001100": 76,
      "100100100": 77,
      "00010000": 78,
      "000100100": 79,
      "000011100": 80,
      "00111101": 81,
      "010011100": 82,
      "11000101": 83,
      "10100101": 84,
      "001101100": 85,
      "10101100": 86,
      "01111100": 87,
      "11000000": 88,
      "11010001": 89,
      "001000001": 90,
      "101010000": 91,
      "001000101": 92,
      "000001101": 93,
      "001001100": 94,
      "11101100": 95,
      "0000010000": 96,
      "011100100": 97,
      "0100100100": 98,
      "001010001": 99
    },
    "merges": [
      [
        "0",
        "0"
      ],
      [
        "0",
        "1"
      ],
      [
        "1",
        "00"
      ],
      [
        "1",
        "01"
      ],
      [
        "00",
        "00"
      ],
      [
        "1",
        "100"
      ],
      [
        "00",
        "01"
      ],
      [
        "1",
        "101"
      ],
      [
        "01",
        "01"
      ],
      [
        "00",
        "100"
      ],
      [
        "1",
        "1100"
      ],
      [
        "00",
        "101"
      ],
      [
        "01",
        "100"
      ],
      [
        "1",
        "1101"
      ],
      [
        "01",
        "0000"
      ],
      [
        "00",
        "1100"
      ],
      [
        "01",
        "101"
      ],
      [
        "100",
        "100"
      ],
      [
        "01",
        "0001"
      ],
      [
        "1",
        "11100"
      ],
      [
        "00",
        "1101"
      ],
      [
        "01",
        "1100"
      ],
      [
        "0000",
        "100"
      ],
      [
        "01",
        "00100"
      ],
      [
        "1",
        "1"
      ],
      [
        "0000",
        "101"
      ],
      [
        "0001",
        "100"
      ],
      [
        "00",
        "11100"
      ],
      [
        "101",
        "100"
      ],
      [
        "01",
        "00101"
      ],
      [
        "0000",
        "0000"
      ],
      [
        "01",
        "1101"
      ],
      [
        "1100",
        "100"
      ],
      [
        "101",
        "0000"
      ],
      [
        "0101",
        "100"
      ],
      [
        "1",
        "11101"
      ],
      [
        "101",
        "0001"
      ],
      [
        "0000",
        "0001"
      ],
      [
        "00",
        "11101"
      ],
      [
        "00100",
        "100"
      ],
      [
        "01",
        "001100"
      ],
      [
        "0001",
        "0001"
      ],
      [
        "0000",
        "1100"
      ],
      [
        "01",
        "11100"
      ],
      [
        "0000",
        "0101"
      ],
      [
        "1",
        "111100"
      ],
      [
        "1101",
        "100"
      ],
      [
        "101",
        "101"
      ],
      [
        "01100",
        "100"
      ],
      [
        "00101",
        "100"
      ],
      [
        "0101",
        "0001"
      ],
      [
        "1100",
        "0001"
      ],
      [
        "00",
        "111100"
      ],
      [
        "0000",
        "1101"
      ],
      [
        "101",
        "00100"
      ],
      [
        "0000",
        "00100"
      ],
      [
        "101",
        "0101"
      ],
      [
        "010000",
        "100"
      ],
      [
        "01",
        "001101"
      ],
      [
        "101",
        "1100"
      ],
      [
        "0000",
        "01100"
      ],
      [
        "0000",
        "00101"
      ],
      [
        "01101",
        "100"
      ],
      [
        "11100",
        "100"
      ],
      [
        "010001",
        "100"
      ],
      [
        "001100",
        "100"
      ],
      [
        "0101",
        "0101"
      ],
      [
        "0001",
        "1100"
      ],
      [
        "1",
        "0"
      ],
      [
        "00",
        "11"
      ],
      [
        "0001",
        "101"
      ],
      [
        "01",
        "11101"
      ],
      [
        "0001",
        "0101"
      ],
      [
        "00100",
        "101"
      ],
      [
        "1100",
        "1100"
      ],
      [
        "100100",
        "100"
      ],
      [
        "0001",
        "0000"
      ],
      [
        "0001",
        "00100"
      ],
      [
        "0000",
        "11100"
      ],
      [
        "00",
        "111101"
      ],
      [
        "01",
        "0011100"
      ],
      [
        "1100",
        "0101"
      ],
      [
        "101",
        "00101"
      ],
      [
        "001101",
        "100"
      ],
      [
        "101",
        "01100"
      ],
      [
        "01",
        "111100"
      ],
      [
        "1100",
        "0000"
      ],
      [
        "1101",
        "0001"
      ],
      [
        "00100",
        "0001"
      ],
      [
        "101",
        "010000"
      ],
      [
        "00100",
        "0101"
      ],
      [
        "0000",
        "01101"
      ],
      [
        "00100",
        "1100"
      ],
      [
        "11101",
        "100"
      ],
      [
        "0000",
        "010000"
      ],
      [
        "011100",
        "100"
      ],
      [
        "0100100",
        "100"
      ],
      [
        "00101",
        "0001"
      ]
    ]
  }
}